--------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/robertackerman/Desktop/School/Labor Econ I/HW/HW3_Ackerman.log
  log type:  text
 opened on:  17 Jul 2014, 17:38:03

. 
. use "nsw.dta"

. set more off

. pause on

. 
. *1 test means for experimental group
. foreach var in age educ nodegree married black hisp re74 re75  {
  2.         ttest `var', by(treated)
  3. }

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     425    24.44706    .3196754    6.590276    23.81871     25.0754
       1 |     297    24.62626    .3879837    6.686391    23.86271    25.38982
---------+--------------------------------------------------------------------
combined |     722    24.52078    .2465922    6.625947    24.03665     25.0049
---------+--------------------------------------------------------------------
    diff |           -.1792038    .5014259               -1.163635    .8052277
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.3574
Ho: diff = 0                                     degrees of freedom =      720

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.3605         Pr(|T| > |t|) = 0.7209          Pr(T > t) = 0.6395

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     425    10.18824    .0785178    1.618686     10.0339    10.34257
       1 |     297    10.38047    .1054743    1.817712     10.1729    10.58805
---------+--------------------------------------------------------------------
combined |     722    10.26731    .0634451    1.704774    10.14275    10.39187
---------+--------------------------------------------------------------------
    diff |           -.1922361     .128823               -.4451497    .0606775
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -1.4922
Ho: diff = 0                                     degrees of freedom =      720

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0680         Pr(|T| > |t|) = 0.1361          Pr(T > t) = 0.9320

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     425    .8141176    .0188921    .3894702    .7769839    .8512514
       1 |     297    .7306397    .0257853    .4443762    .6798939    .7813855
---------+--------------------------------------------------------------------
combined |     722    .7797784    .0154329    .4146833    .7494796    .8100772
---------+--------------------------------------------------------------------
    diff |            .0834779    .0312298                .0221655    .1447903
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   2.6730
Ho: diff = 0                                     degrees of freedom =      720

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9962         Pr(|T| > |t|) = 0.0077          Pr(T > t) = 0.0038

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     425    .1576471    .0176973    .3648392    .1228617    .1924324
       1 |     297    .1683502    .0217486    .3748085    .1255487    .2111516
---------+--------------------------------------------------------------------
combined |     722    .1620499    .0137235     .368752     .135107    .1889927
---------+--------------------------------------------------------------------
    diff |           -.0107031    .0279053               -.0654887    .0440824
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.3836
Ho: diff = 0                                     degrees of freedom =      720

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.3507         Pr(|T| > |t|) = 0.7014          Pr(T > t) = 0.6493

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     425          .8    .0194257    .4004714    .7618173    .8381827
       1 |     297    .8013468    .0231906    .3996597    .7557074    .8469862
---------+--------------------------------------------------------------------
combined |     722     .800554    .0148813    .3998609    .7713382    .8297698
---------+--------------------------------------------------------------------
    diff |           -.0013468    .0302626               -.0607602    .0580666
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.0445
Ho: diff = 0                                     degrees of freedom =      720

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.4823         Pr(|T| > |t|) = 0.9645          Pr(T > t) = 0.5177

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     425    .1129412    .0153716    .3168939    .0827271    .1431552
       1 |     297    .0942761    .0169845    .2927056    .0608504    .1277018
---------+--------------------------------------------------------------------
combined |     722    .1052632    .0114293     .307105    .0828245    .1277018
---------+--------------------------------------------------------------------
    diff |            .0186651    .0232322               -.0269458    .0642759
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.8034
Ho: diff = 0                                     degrees of freedom =      720

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.7890         Pr(|T| > |t|) = 0.4220          Pr(T > t) = 0.2110

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     425    3672.485    316.3405    6521.526    3050.694    4294.276
       1 |     297    3570.999    334.9912    5773.134    2911.733    4230.265
---------+--------------------------------------------------------------------
combined |     722    3630.738    231.5081    6220.637    3176.227    4085.249
---------+--------------------------------------------------------------------
    diff |            101.4862    470.7802               -822.7797    1025.752
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.2156
Ho: diff = 0                                     degrees of freedom =      720

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.5853         Pr(|T| > |t|) = 0.8294          Pr(T > t) = 0.4147

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     425    3026.683    252.2977     5201.25    2530.773    3522.593
       1 |     297    3066.098    282.8697    4874.889    2509.407    3622.789
---------+--------------------------------------------------------------------
combined |     722    3042.897    188.5423    5066.143    2672.739    3413.054
---------+--------------------------------------------------------------------
    diff |           -39.41545    383.4172               -792.1647    713.3338
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.1028
Ho: diff = 0                                     degrees of freedom =      720

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.4591         Pr(|T| > |t|) = 0.9181          Pr(T > t) = 0.5409

. *1 regress re78 on treated age age^2...
. gen agesq=age^2

. reg re78 treated age agesq educ black hisp married nodegree re74 re75

      Source |       SS       df       MS              Number of obs =     722
-------------+------------------------------           F( 10,   711) =    3.38
       Model |  1.2791e+09    10   127910104           Prob > F      =  0.0003
    Residual |  2.6911e+10   711  37850203.4           R-squared     =  0.0454
-------------+------------------------------           Adj R-squared =  0.0319
       Total |  2.8191e+10   721  39099300.5           Root MSE      =  6152.3

------------------------------------------------------------------------------
        re78 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     treated |   818.7003   468.1688     1.75   0.081    -100.4583    1737.859
         age |  -145.9217   214.0751    -0.68   0.496    -566.2167    274.3733
       agesq |   2.799479   3.585079     0.78   0.435    -4.239129    9.838087
        educ |   206.8112   181.7607     1.14   0.256    -150.0406    563.6631
       black |  -1461.261   801.5939    -1.82   0.069    -3035.036    112.5127
        hisp |   100.4831   1047.164     0.10   0.924     -1955.42    2156.387
     married |   133.9094   655.5439     0.20   0.838    -1153.124    1420.943
    nodegree |   -405.909   747.6136    -0.54   0.587    -1873.703    1061.885
        re74 |   .0871344   .0710423     1.23   0.220    -.0523434    .2266122
        re75 |   .0839624   .0879958     0.95   0.340    -.0888003     .256725
       _cons |    5648.81   3676.888     1.54   0.125    -1570.046    12867.67
------------------------------------------------------------------------------

. 
. *2 generate d
. gen d=1 if sample==1
(18482 missing values generated)

. replace d=0 if sample==3
(2490 real changes made)

. 
. *2 test means for psid comparison group
. foreach var in age educ nodegree married black hisp re74 re75  {
  2.         ttest `var', by(d)
  3. }

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |    2490     34.8506     .209234    10.44076    34.44031    35.26089
       1 |     722    24.52078    .2465922    6.625947    24.03665     25.0049
---------+--------------------------------------------------------------------
combined |    3212    32.52864    .1875285    10.62809    32.16095    32.89633
---------+--------------------------------------------------------------------
    diff |            10.32983    .4106511                9.524662    11.13499
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  25.1548
Ho: diff = 0                                     degrees of freedom =     3210

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |    2490    12.11687    .0617724    3.082435    11.99574      12.238
       1 |     722    10.26731    .0634451    1.704774    10.14275    10.39187
---------+--------------------------------------------------------------------
combined |    3212    11.70112    .0517858    2.934936    11.59958    11.80266
---------+--------------------------------------------------------------------
    diff |            1.849554    .1197039                1.614851    2.084258
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  15.4511
Ho: diff = 0                                     degrees of freedom =     3210

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |    2490    .3052209    .0092303    .4605934    .2871209    .3233208
       1 |     722    .7797784    .0154329    .4146833    .7494796    .8100772
---------+--------------------------------------------------------------------
combined |    3212    .4118929    .0086856    .4922526     .394863    .4289228
---------+--------------------------------------------------------------------
    diff |           -.4745575    .0190501                -.511909    -.437206
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t = -24.9111
Ho: diff = 0                                     degrees of freedom =     3210

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 1.0000

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |    2490    .8662651    .0068224    .3404357     .852887    .8796432
       1 |     722    .1620499    .0137235     .368752     .135107    .1889927
---------+--------------------------------------------------------------------
combined |    3212    .7079701    .0080242    .4547668    .6922371    .7237032
---------+--------------------------------------------------------------------
    diff |            .7042152    .0146671                .6754573    .7329731
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  48.0131
Ho: diff = 0                                     degrees of freedom =     3210

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |    2490    .2506024    .0086863     .433447    .2335692    .2676356
       1 |     722     .800554    .0148813    .3998609    .7713382    .8297698
---------+--------------------------------------------------------------------
combined |    3212    .3742217    .0085399    .4839966    .3574774    .3909659
---------+--------------------------------------------------------------------
    diff |           -.5499516    .0180121               -.5852681   -.5146351
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t = -30.5323
Ho: diff = 0                                     degrees of freedom =     3210

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 1.0000

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |    2490    .0325301    .0035559    .1774389    .0255573    .0395029
       1 |     722    .1052632    .0114293     .307105    .0828245    .1277018
---------+--------------------------------------------------------------------
combined |    3212    .0488792     .003805     .215649    .0414186    .0563398
---------+--------------------------------------------------------------------
    diff |            -.072733    .0090258                 -.09043   -.0550361
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -8.0583
Ho: diff = 0                                     degrees of freedom =     3210

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 1.0000

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |    2490    19428.75    268.6754    13406.88     18901.9     19955.6
       1 |     722    3630.738    231.5081    6220.637    3176.227    4085.249
---------+--------------------------------------------------------------------
combined |    3212    15877.64    244.1858    13839.11    15398.86    16356.41
---------+--------------------------------------------------------------------
    diff |            15798.01    514.3319                14789.56    16806.46
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  30.7156
Ho: diff = 0                                     degrees of freedom =     3210

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |    2490    19063.34    272.4846    13596.95    18529.02    19597.66
       1 |     722    3042.897    188.5423    5066.143    2672.739    3413.054
---------+--------------------------------------------------------------------
combined |    3212    15462.23    245.6391    13921.48     14980.6    15943.86
---------+--------------------------------------------------------------------
    diff |            16020.44    516.1578                15008.41    17032.47
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  31.0379
Ho: diff = 0                                     degrees of freedom =     3210

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. *3 score set 1
. probit d age agesq educ black hisp married nodegree

Iteration 0:   log likelihood = -1711.6561  
Iteration 1:   log likelihood = -764.64542  
Iteration 2:   log likelihood = -695.62933  
Iteration 3:   log likelihood = -692.04134  
Iteration 4:   log likelihood = -692.02963  
Iteration 5:   log likelihood = -692.02963  

Probit regression                                 Number of obs   =       3212
                                                  LR chi2(7)      =    2039.25
                                                  Prob > chi2     =     0.0000
Log likelihood = -692.02963                       Pseudo R2       =     0.5957

------------------------------------------------------------------------------
           d |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .0283333   .0331146     0.86   0.392    -.0365701    .0932367
       agesq |  -.0013175   .0005081    -2.59   0.010    -.0023133   -.0003216
        educ |  -.0231607   .0237644    -0.97   0.330     -.069738    .0234166
       black |   1.256955   .0910682    13.80   0.000     1.078465    1.435446
        hisp |   1.413607    .162806     8.68   0.000     1.094513    1.732701
     married |  -1.533573   .0799421   -19.18   0.000    -1.690256   -1.376889
    nodegree |   .8817484    .110417     7.99   0.000      .665335    1.098162
       _cons |  -.5227885   .5599591    -0.93   0.351    -1.620288    .5747111
------------------------------------------------------------------------------

. predict scoreset1
(option pr assumed; Pr(d))

. 
. *3 score set 2
. probit d age agesq educ black hisp married nodegree re74 re75

Iteration 0:   log likelihood = -1711.6561  
Iteration 1:   log likelihood = -723.77489  
Iteration 2:   log likelihood = -584.23573  
Iteration 3:   log likelihood = -576.06673  
Iteration 4:   log likelihood = -576.03443  
Iteration 5:   log likelihood = -576.03443  

Probit regression                                 Number of obs   =       3212
                                                  LR chi2(9)      =    2271.24
                                                  Prob > chi2     =     0.0000
Log likelihood = -576.03443                       Pseudo R2       =     0.6635

------------------------------------------------------------------------------
           d |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .0912584   .0366058     2.49   0.013     .0195123    .1630046
       agesq |  -.0021861   .0005629    -3.88   0.000    -.0032892   -.0010829
        educ |  -.0020361   .0262264    -0.08   0.938    -.0534389    .0493668
       black |   1.077704   .0993622    10.85   0.000     .8829579     1.27245
        hisp |   1.267766   .1780798     7.12   0.000      .918736    1.616796
     married |  -1.237481   .0884377   -13.99   0.000    -1.410816   -1.064147
    nodegree |   .7169147   .1207162     5.94   0.000     .4803152    .9535142
        re74 |   -.000025   8.29e-06    -3.01   0.003    -.0000412   -8.70e-06
        re75 |  -.0000625   9.18e-06    -6.81   0.000    -.0000805   -.0000445
       _cons |  -.9809825   .6156589    -1.59   0.111    -2.187652    .2256869
------------------------------------------------------------------------------
Note: 135 failures and 0 successes completely determined.

. predict scoreset2
(option pr assumed; Pr(d))

. 
. *3 plot d re75
. graph twoway (scatter d re75), xtitle('Real Earnings 1975') ytitle('Experimental Sample Indicator')

. pause
pause:  
-> . 
-> . 
-> . 
-> . 
-> . 
-> . 
-> . end
execution resumes...

. 
. *4 compare distributions using summary statistics
. sum scoreset1 if d==0, d

                            Pr(d)
-------------------------------------------------------------
      Percentiles      Smallest
 1%     1.21e-06       5.38e-07
 5%     .0000127       6.05e-07
10%     .0000671       6.05e-07       Obs                2490
25%     .0012715       6.05e-07       Sum of Wgt.        2490

50%     .0065122                      Mean           .0842765
                        Largest       Std. Dev.      .1758006
75%     .0832247       .9292618
90%     .2252269       .9292618       Variance       .0309058
95%     .5273062       .9295616       Skewness       2.994606
99%     .9058931       .9381813       Kurtosis       12.04161

. sum scoreset1 if d==1, d

                            Pr(d)
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0240672         .00086
 5%      .117327       .0022985
10%     .2345118       .0053419       Obs                 722
25%     .5479688       .0079078       Sum of Wgt.         722

50%     .8738455                      Mean           .7075695
                        Largest       Std. Dev.      .2727188
75%     .9227759       .9525825
90%     .9323288       .9525825       Variance       .0743756
95%     .9421368       .9550889       Skewness      -1.029569
99%     .9505416       .9569874       Kurtosis       2.824737

. 
. sum scoreset2 if d==0, d

                            Pr(d)
-------------------------------------------------------------
      Percentiles      Smallest
 1%     2.52e-15              0
 5%     3.40e-10       1.47e-34
10%     6.58e-08       4.53e-31       Obs                2490
25%     .0000421       5.83e-27       Sum of Wgt.        2490

50%     .0021401                      Mean           .0699233
                        Largest       Std. Dev.      .1644082
75%     .0422126       .9560345
90%     .2328297       .9585196       Variance         .02703
95%     .4396901       .9585196       Skewness       3.276627
99%     .8728482       .9588797       Kurtosis       14.22637

. sum scoreset2 if d==1, d

                            Pr(d)
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0299349       .0000563
 5%     .1532486       .0002028
10%     .3418762       .0013815       Obs                 722
25%     .6680468       .0017097       Sum of Wgt.         722

50%     .8752777                      Mean           .7628783
                        Largest       Std. Dev.      .2544333
75%     .9523113       .9735799
90%     .9584456         .97363       Variance       .0647363
95%     .9595995       .9738218       Skewness       -1.42787
99%     .9732038       .9739206       Kurtosis       4.053844

. 
. *5 histograms by exper/psid group
. hist scoreset1, start(0.0) width(0.05) by(d,col(1))

. pause
pause:  
-> . 
-> . 
-> . 
-> . end
execution resumes...

. histogram scoreset2, start(0.0) width(0.05) by(d,col(1))

. pause
pause:  
-> . end
execution resumes...

. 
. *6 nearest neighbor no replacement
. drop if treated==1
(297 observations deleted)

. 
. psmatch2 d age agesq educ black hisp married nodegree, out(re78) common noreplace

Probit regression                                 Number of obs   =       2915
                                                  LR chi2(7)      =    1437.27
                                                  Prob > chi2     =     0.0000
Log likelihood = -492.11029                       Pseudo R2       =     0.5935

------------------------------------------------------------------------------
           d |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .0305025   .0390021     0.78   0.434    -.0459402    .1069452
       agesq |  -.0013955   .0006043    -2.31   0.021    -.0025799   -.0002111
        educ |  -.0088444   .0284386    -0.31   0.756    -.0645831    .0468943
       black |   1.253348   .1127332    11.12   0.000     1.032395    1.474301
        hisp |   1.514216    .190757     7.94   0.000     1.140339    1.888092
     married |  -1.511653   .0956131   -15.81   0.000    -1.699052   -1.324255
    nodegree |   1.030696   .1321142     7.80   0.000     .7717573    1.289635
       _cons |  -1.094042   .6678223    -1.64   0.101     -2.40295    .2148653
------------------------------------------------------------------------------
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            re78  Unmatched |  5090.0482   21553.9209  -16463.8727   763.288686   -21.57
                        ATT | 4977.46156    14845.055  -9867.59342   653.275864   -15.10
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,490 |     2,490 
   Treated |        28        397 |       425 
-----------+----------------------+----------
     Total |        28      2,887 |     2,915 


. psmatch2 d age agesq educ black hisp married nodegree re74 re75, out(re78) common noreplace

Probit regression                                 Number of obs   =       2915
                                                  LR chi2(9)      =    1574.47
                                                  Prob > chi2     =     0.0000
Log likelihood = -423.50897                       Pseudo R2       =     0.6502

------------------------------------------------------------------------------
           d |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .0914548   .0422493     2.16   0.030     .0086477    .1742618
       agesq |  -.0022069   .0006545    -3.37   0.001    -.0034898   -.0009241
        educ |   .0123268   .0306812     0.40   0.688    -.0478073    .0724609
       black |   1.071924   .1202664     8.91   0.000     .8362057    1.307641
        hisp |   1.317937   .2062251     6.39   0.000      .913743     1.72213
     married |  -1.230043   .1040172   -11.83   0.000    -1.433913   -1.026173
    nodegree |   .8606035   .1422113     6.05   0.000     .5818744    1.139333
        re74 |  -.0000224   9.65e-06    -2.32   0.020    -.0000413   -3.48e-06
        re75 |  -.0000587   .0000108    -5.44   0.000    -.0000799   -.0000376
       _cons |  -1.562726   .7185895    -2.17   0.030    -2.971136   -.1543169
------------------------------------------------------------------------------
Note: 159 failures and 0 successes completely determined.
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            re78  Unmatched |  5090.0482   21553.9209  -16463.8727   763.288686   -21.57
                        ATT | 5033.57854   11110.9035  -6077.32499   583.892632   -10.41
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,490 |     2,490 
   Treated |        27        398 |       425 
-----------+----------------------+----------
     Total |        27      2,888 |     2,915 


. 
. *7 nearest neighbor replacment
. psmatch2 d age agesq educ black hisp married nodegree, out(re78) common 

Probit regression                                 Number of obs   =       2915
                                                  LR chi2(7)      =    1437.27
                                                  Prob > chi2     =     0.0000
Log likelihood = -492.11029                       Pseudo R2       =     0.5935

------------------------------------------------------------------------------
           d |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .0305025   .0390021     0.78   0.434    -.0459402    .1069452
       agesq |  -.0013955   .0006043    -2.31   0.021    -.0025799   -.0002111
        educ |  -.0088444   .0284386    -0.31   0.756    -.0645831    .0468943
       black |   1.253348   .1127332    11.12   0.000     1.032395    1.474301
        hisp |   1.514216    .190757     7.94   0.000     1.140339    1.888092
     married |  -1.511653   .0956131   -15.81   0.000    -1.699052   -1.324255
    nodegree |   1.030696   .1321142     7.80   0.000     .7717573    1.289635
       _cons |  -1.094042   .6678223    -1.64   0.101     -2.40295    .2148653
------------------------------------------------------------------------------
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            re78  Unmatched |  5090.0482   21553.9209  -16463.8727   763.288686   -21.57
                        ATT | 4977.46156   10074.2092  -5096.74762    1756.3798    -2.90
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,490 |     2,490 
   Treated |        28        397 |       425 
-----------+----------------------+----------
     Total |        28      2,887 |     2,915 


. psmatch2 d age agesq educ black hisp married nodegree re74 re75, out(re78) common 

Probit regression                                 Number of obs   =       2915
                                                  LR chi2(9)      =    1574.47
                                                  Prob > chi2     =     0.0000
Log likelihood = -423.50897                       Pseudo R2       =     0.6502

------------------------------------------------------------------------------
           d |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .0914548   .0422493     2.16   0.030     .0086477    .1742618
       agesq |  -.0022069   .0006545    -3.37   0.001    -.0034898   -.0009241
        educ |   .0123268   .0306812     0.40   0.688    -.0478073    .0724609
       black |   1.071924   .1202664     8.91   0.000     .8362057    1.307641
        hisp |   1.317937   .2062251     6.39   0.000      .913743     1.72213
     married |  -1.230043   .1040172   -11.83   0.000    -1.433913   -1.026173
    nodegree |   .8606035   .1422113     6.05   0.000     .5818744    1.139333
        re74 |  -.0000224   9.65e-06    -2.32   0.020    -.0000413   -3.48e-06
        re75 |  -.0000587   .0000108    -5.44   0.000    -.0000799   -.0000376
       _cons |  -1.562726   .7185895    -2.17   0.030    -2.971136   -.1543169
------------------------------------------------------------------------------
Note: 159 failures and 0 successes completely determined.
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            re78  Unmatched |  5090.0482   21553.9209  -16463.8727   763.288686   -21.57
                        ATT | 5033.57854   6079.48222  -1045.90368   1439.01747    -0.73
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,490 |     2,490 
   Treated |        27        398 |       425 
-----------+----------------------+----------
     Total |        27      2,888 |     2,915 


. 
. gen quartiles1=.
(18907 missing values generated)

. replace quartiles1=1 if scoreset1>=0 & scoreset1<.25
(16218 real changes made)

. replace quartiles1=2 if scoreset1>=.25 & scoreset1<.5
(591 real changes made)

. replace quartiles1=3 if scoreset1>=.5 & scoreset1<.75
(1458 real changes made)

. replace quartiles1=4 if scoreset1>=.75 & scoreset1<1
(640 real changes made)

. 
. psmatch2 d age agesq educ black hisp married nodegree if quartiles1==1, out(re78) common 

Probit regression                                 Number of obs   =       2292
                                                  LR chi2(7)      =      86.10
                                                  Prob > chi2     =     0.0000
Log likelihood = -150.41861                       Pseudo R2       =     0.2225

------------------------------------------------------------------------------
           d |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .0718988   .0684573     1.05   0.294     -.062275    .2060726
       agesq |   -.001758   .0010015    -1.76   0.079    -.0037209    .0002049
        educ |  -.0665443   .0437337    -1.52   0.128    -.1522609    .0191722
       black |   1.199667   .2223585     5.40   0.000     .7638519    1.635481
        hisp |    .777393   .4558631     1.71   0.088    -.1160822    1.670868
     married |  -1.453716   .2423784    -6.00   0.000    -1.928769   -.9786628
    nodegree |   .4315421   .2860433     1.51   0.131    -.1290924    .9921766
       _cons |    -1.1561   1.129122    -1.02   0.306    -3.369138    1.056938
------------------------------------------------------------------------------
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            re78  Unmatched | 7055.12966    22496.331  -15441.2014   2540.79664    -6.08
                        ATT | 7055.12966   18131.6272  -11076.4975    2855.1102    -3.88
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |     2,254 |     2,254 
   Treated |        38 |        38 
-----------+-----------+----------
     Total |     2,292 |     2,292 


. pstest re78, both

------------------------------------------------------------------------------
                Unmatched |       Mean               %reduct |     t-test
    Variable      Matched | Treated Control    %bias  |bias| |    t    p>|t|
--------------------------+----------------------------------+----------------
         re78   Unmatched | 7055.1    22496   -129.4         |  -6.08  0.000
                 Matched  | 7055.1    18132    -92.8    28.3 |  -4.24  0.000
                          |                                  |
------------------------------------------------------------------------------
-------------------------------------------------------------
         Summary of the distribution of the abs(bias)
-------------------------------------------------------------

                       BEFORE MATCHING
-------------------------------------------------------------
      Percentiles      Smallest
 1%      129.407        129.407
 5%      129.407              .
10%      129.407              .       Obs                   1
25%      129.407              .       Sum of Wgt.           1

50%      129.407                      Mean            129.407
                        Largest       Std. Dev.             .
75%      129.407              .
90%      129.407              .       Variance              .
95%      129.407              .       Skewness              .
99%      129.407        129.407       Kurtosis              .
-------------------------------------------------------------

                       AFTER MATCHING
-------------------------------------------------------------
      Percentiles      Smallest
 1%     92.82804       92.82804
 5%     92.82804              .
10%     92.82804              .       Obs                   1
25%     92.82804              .       Sum of Wgt.           1

50%     92.82804                      Mean           92.82804
                        Largest       Std. Dev.             .
75%     92.82804              .
90%     92.82804              .       Variance              .
95%     92.82804              .       Skewness              .
99%     92.82804       92.82804       Kurtosis              .
-------------------------------------------------------------

-----------------------------------------------------------------
 Sample  | Pseudo R2    LR chi2    p>chi2    MeanBias    MedBias
---------+-------------------------------------------------------
 Raw     |    0.138       53.43    0.000      129.4      129.4
 Matched |    0.180       18.91    0.000       92.8       92.8
-----------------------------------------------------------------

. psmatch2 d age agesq educ black hisp married nodegree if quartiles1==2, out(re78) common 

Probit regression                                 Number of obs   =        160
                                                  LR chi2(7)      =      17.12
                                                  Prob > chi2     =     0.0167
Log likelihood = -92.334068                       Pseudo R2       =     0.0848

------------------------------------------------------------------------------
           d |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .2000585   .1991737     1.00   0.315    -.1903148    .5904318
       agesq |  -.0044963   .0035508    -1.27   0.205    -.0114558    .0024633
        educ |   .1504111   .0751637     2.00   0.045      .003093    .2977292
       black |   1.649219   1.661296     0.99   0.321    -1.606861    4.905299
        hisp |   2.056224   1.770631     1.16   0.246    -1.414148    5.526597
     married |  -2.528066   1.651508    -1.53   0.126    -5.764962    .7088304
    nodegree |   1.861233   1.462633     1.27   0.203    -1.005475    4.727941
       _cons |  -5.026036   4.108116    -1.22   0.221     -13.0778    3.025724
------------------------------------------------------------------------------
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            re78  Unmatched | 4427.31858    13370.552  -8943.23346    1906.0685    -4.69
                        ATT | 4427.31858   16280.7956   -11853.477   4621.40275    -2.56
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |       108 |       108 
   Treated |        52 |        52 
-----------+-----------+----------
     Total |       160 |       160 


. pstest re78, both

------------------------------------------------------------------------------
                Unmatched |       Mean               %reduct |     t-test
    Variable      Matched | Treated Control    %bias  |bias| |    t    p>|t|
--------------------------+----------------------------------+----------------
         re78   Unmatched | 4427.3    13371    -89.2         |  -4.69  0.000
                 Matched  | 4427.3    16281   -118.2   -32.5 |  -5.01  0.000
                          |                                  |
------------------------------------------------------------------------------
-------------------------------------------------------------
         Summary of the distribution of the abs(bias)
-------------------------------------------------------------

                       BEFORE MATCHING
-------------------------------------------------------------
      Percentiles      Smallest
 1%     89.16132       89.16132
 5%     89.16132              .
10%     89.16132              .       Obs                   1
25%     89.16132              .       Sum of Wgt.           1

50%     89.16132                      Mean           89.16132
                        Largest       Std. Dev.             .
75%     89.16132              .
90%     89.16132              .       Variance              .
95%     89.16132              .       Skewness              .
99%     89.16132       89.16132       Kurtosis              .
-------------------------------------------------------------

                       AFTER MATCHING
-------------------------------------------------------------
      Percentiles      Smallest
 1%     118.1756       118.1756
 5%     118.1756              .
10%     118.1756              .       Obs                   1
25%     118.1756              .       Sum of Wgt.           1

50%     118.1756                      Mean           118.1756
                        Largest       Std. Dev.             .
75%     118.1756              .
90%     118.1756              .       Variance              .
95%     118.1756              .       Skewness              .
99%     118.1756       118.1756       Kurtosis              .
-------------------------------------------------------------

-----------------------------------------------------------------
 Sample  | Pseudo R2    LR chi2    p>chi2    MeanBias    MedBias
---------+-------------------------------------------------------
 Raw     |    0.217       43.74    0.000       89.2       89.2
 Matched |    0.389       56.12    0.000      118.2      118.2
-----------------------------------------------------------------

. psmatch2 d age agesq educ black hisp married nodegree if quartiles1==3, out(re78) common 

Probit regression                                 Number of obs   =        158
                                                  LR chi2(7)      =       5.04
                                                  Prob > chi2     =     0.6556
Log likelihood = -106.99957                       Pseudo R2       =     0.0230

------------------------------------------------------------------------------
           d |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0171638   .1642813    -0.10   0.917    -.3391491    .3048216
       agesq |   .0010828   .0031207     0.35   0.729    -.0050338    .0071993
        educ |  -.1205483   .0802823    -1.50   0.133    -.2778986    .0368021
       black |  -1.057118    .940341    -1.12   0.261    -2.900153    .7859162
        hisp |  -.9240022   1.076759    -0.86   0.391    -3.034412    1.186407
     married |   1.032378   1.201525     0.86   0.390    -1.322568    3.387325
    nodegree |  -.9899496   .9146162    -1.08   0.279    -2.782564    .8026651
       _cons |   2.243683   2.780049     0.81   0.420    -3.205113     7.69248
------------------------------------------------------------------------------
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            re78  Unmatched | 5211.60545   14494.0098  -9282.40437   1274.04892    -7.29
                        ATT | 5211.60545   14061.5036  -8849.89811   2315.36345    -3.82
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |        79 |        79 
   Treated |        79 |        79 
-----------+-----------+----------
     Total |       158 |       158 


. pstest re78, both

------------------------------------------------------------------------------
                Unmatched |       Mean               %reduct |     t-test
    Variable      Matched | Treated Control    %bias  |bias| |    t    p>|t|
--------------------------+----------------------------------+----------------
         re78   Unmatched | 5211.6    14494   -115.9         |  -7.29  0.000
                 Matched  | 5211.6    14062   -110.5     4.7 |  -7.07  0.000
                          |                                  |
------------------------------------------------------------------------------
-------------------------------------------------------------
         Summary of the distribution of the abs(bias)
-------------------------------------------------------------

                       BEFORE MATCHING
-------------------------------------------------------------
      Percentiles      Smallest
 1%     115.9247       115.9247
 5%     115.9247              .
10%     115.9247              .       Obs                   1
25%     115.9247              .       Sum of Wgt.           1

50%     115.9247                      Mean           115.9247
                        Largest       Std. Dev.             .
75%     115.9247              .
90%     115.9247              .       Variance              .
95%     115.9247              .       Skewness              .
99%     115.9247       115.9247       Kurtosis              .
-------------------------------------------------------------

                       AFTER MATCHING
-------------------------------------------------------------
      Percentiles      Smallest
 1%     110.5232       110.5232
 5%     110.5232              .
10%     110.5232              .       Obs                   1
25%     110.5232              .       Sum of Wgt.           1

50%     110.5232                      Mean           110.5232
                        Largest       Std. Dev.             .
75%     110.5232              .
90%     110.5232              .       Variance              .
95%     110.5232              .       Skewness              .
99%     110.5232       110.5232       Kurtosis              .
-------------------------------------------------------------

-----------------------------------------------------------------
 Sample  | Pseudo R2    LR chi2    p>chi2    MeanBias    MedBias
---------+-------------------------------------------------------
 Raw     |    0.216       47.35    0.000      115.9      115.9
 Matched |    0.206       45.17    0.000      110.5      110.5
-----------------------------------------------------------------

. psmatch2 d age agesq educ black hisp married nodegree if quartiles1==4, out(re78) common 
note: black dropped because of collinearity
note: married dropped because of collinearity
note: nodegree dropped because of collinearity

Probit regression                                 Number of obs   =        305
                                                  LR chi2(4)      =      23.84
                                                  Prob > chi2     =     0.0001
Log likelihood = -122.51244                       Pseudo R2       =     0.0887

------------------------------------------------------------------------------
           d |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.3162158   .1736639    -1.82   0.069    -.6565909    .0241592
       agesq |   .0049025   .0033304     1.47   0.141     -.001625      .01143
        educ |   .0258726   .0664191     0.39   0.697    -.1043064    .1560515
        hisp |   .9126677   .4603048     1.98   0.047     .0104868    1.814849
       _cons |   5.292003   2.260769     2.34   0.019      .860977    9.723029
------------------------------------------------------------------------------
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            re78  Unmatched | 4895.46157   7622.17394  -2726.71237   924.604596    -2.95
                        ATT | 4672.05567   7839.80409  -3167.74842   2258.11867    -1.40
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0         49 |        49 
   Treated |        27        229 |       256 
-----------+----------------------+----------
     Total |        27        278 |       305 


. pstest re78, both

------------------------------------------------------------------------------
                Unmatched |       Mean               %reduct |     t-test
    Variable      Matched | Treated Control    %bias  |bias| |    t    p>|t|
--------------------------+----------------------------------+----------------
         re78   Unmatched | 4895.5   7622.2    -42.6         |  -2.95  0.003
                 Matched  | 4672.1   7839.8    -49.4   -16.2 |  -5.74  0.000
                          |                                  |
------------------------------------------------------------------------------
-------------------------------------------------------------
         Summary of the distribution of the abs(bias)
-------------------------------------------------------------

                       BEFORE MATCHING
-------------------------------------------------------------
      Percentiles      Smallest
 1%     42.55873       42.55873
 5%     42.55873              .
10%     42.55873              .       Obs                   1
25%     42.55873              .       Sum of Wgt.           1

50%     42.55873                      Mean           42.55873
                        Largest       Std. Dev.             .
75%     42.55873              .
90%     42.55873              .       Variance              .
95%     42.55873              .       Skewness              .
99%     42.55873       42.55873       Kurtosis              .
-------------------------------------------------------------

                       AFTER MATCHING
-------------------------------------------------------------
      Percentiles      Smallest
 1%     49.44246       49.44246
 5%     49.44246              .
10%     49.44246              .       Obs                   1
25%     49.44246              .       Sum of Wgt.           1

50%     49.44246                      Mean           49.44246
                        Largest       Std. Dev.             .
75%     49.44246              .
90%     49.44246              .       Variance              .
95%     49.44246              .       Skewness              .
99%     49.44246       49.44246       Kurtosis              .
-------------------------------------------------------------

-----------------------------------------------------------------
 Sample  | Pseudo R2    LR chi2    p>chi2    MeanBias    MedBias
---------+-------------------------------------------------------
 Raw     |    0.029        7.69    0.006       42.6       42.6
 Matched |    0.050       31.97    0.000       49.4       49.4
-----------------------------------------------------------------

. 
. 
. gen quartiles2=.
(18907 missing values generated)

. replace quartiles2=1 if scoreset2>=0 & scoreset2<.25
(15154 real changes made)

. replace quartiles2=2 if scoreset2>=.25 & scoreset2<.5
(1755 real changes made)

. replace quartiles2=3 if scoreset2>=.5 & scoreset2<.75
(1271 real changes made)

. replace quartiles2=4 if scoreset2>=.75 & scoreset2<1
(727 real changes made)

. 
. psmatch2 d age agesq educ black hisp married nodegree re74 re75 if quartiles2==1, out(re78) common 

Probit regression                                 Number of obs   =       2281
                                                  LR chi2(9)      =      71.83
                                                  Prob > chi2     =     0.0000
Log likelihood =   -101.786                       Pseudo R2       =     0.2608

------------------------------------------------------------------------------
           d |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |    -.01699   .0793419    -0.21   0.830    -.1724973    .1385172
       agesq |  -.0005148   .0011404    -0.45   0.652    -.0027501    .0017204
        educ |  -.0473003   .0556352    -0.85   0.395    -.1563432    .0617426
       black |   1.013399   .2171723     4.67   0.000     .5877494    1.439049
        hisp |   .5796457    .494277     1.17   0.241    -.3891194    1.548411
     married |  -1.034862   .2418146    -4.28   0.000     -1.50881    -.560914
    nodegree |   .7920603    .288885     2.74   0.006     .2258561    1.358265
        re74 |    .000026   .0000143     1.82   0.069    -2.06e-06    .0000541
        re75 |  -.0000305    .000015    -2.03   0.043    -.0000599   -1.02e-06
       _cons |  -.5276496   1.348998    -0.39   0.696    -3.171637    2.116338
------------------------------------------------------------------------------
Note: 1 failure and 0 successes completely determined.
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            re78  Unmatched | 9359.28157   22777.6393  -13418.3577   3098.77238    -4.33
                        ATT | 8843.63775   17794.6548  -8951.01702   2627.36457    -3.41
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,256 |     2,256 
   Treated |         2         23 |        25 
-----------+----------------------+----------
     Total |         2      2,279 |     2,281 


. pstest re78, both

------------------------------------------------------------------------------
                Unmatched |       Mean               %reduct |     t-test
    Variable      Matched | Treated Control    %bias  |bias| |    t    p>|t|
--------------------------+----------------------------------+----------------
         re78   Unmatched | 9359.3    22778   -112.2         |  -4.33  0.000
                 Matched  | 8843.6    17795    -74.8    33.3 |  -3.86  0.000
                          |                                  |
------------------------------------------------------------------------------
-------------------------------------------------------------
         Summary of the distribution of the abs(bias)
-------------------------------------------------------------

                       BEFORE MATCHING
-------------------------------------------------------------
      Percentiles      Smallest
 1%     112.1814       112.1814
 5%     112.1814              .
10%     112.1814              .       Obs                   1
25%     112.1814              .       Sum of Wgt.           1

50%     112.1814                      Mean           112.1814
                        Largest       Std. Dev.             .
75%     112.1814              .
90%     112.1814              .       Variance              .
95%     112.1814              .       Skewness              .
99%     112.1814       112.1814       Kurtosis              .
-------------------------------------------------------------

                       AFTER MATCHING
-------------------------------------------------------------
      Percentiles      Smallest
 1%     74.83314       74.83314
 5%     74.83314              .
10%     74.83314              .       Obs                   1
25%     74.83314              .       Sum of Wgt.           1

50%     74.83314                      Mean           74.83314
                        Largest       Std. Dev.             .
75%     74.83314              .
90%     74.83314              .       Variance              .
95%     74.83314              .       Skewness              .
99%     74.83314       74.83314       Kurtosis              .
-------------------------------------------------------------

-----------------------------------------------------------------
 Sample  | Pseudo R2    LR chi2    p>chi2    MeanBias    MedBias
---------+-------------------------------------------------------
 Raw     |    0.095       26.18    0.000      112.2      112.2
 Matched |    0.206       13.15    0.000       74.8       74.8
-----------------------------------------------------------------

. psmatch2 d age agesq educ black hisp married nodegree re74 re75 if quartiles2==2, out(re78) common 

Probit regression                                 Number of obs   =        176
                                                  LR chi2(9)      =      12.02
                                                  Prob > chi2     =     0.2120
Log likelihood = -87.076917                       Pseudo R2       =     0.0646

------------------------------------------------------------------------------
           d |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .1756576   .1211118     1.45   0.147    -.0617171    .4130324
       agesq |   -.002587   .0020956    -1.23   0.217    -.0066943    .0015204
        educ |   .0231233   .0621454     0.37   0.710    -.0986794    .1449261
       black |  -.1645569   .7621836    -0.22   0.829    -1.658409    1.329296
        hisp |  -.0348336   .9256174    -0.04   0.970     -1.84901    1.779343
     married |   .2105465   .8204418     0.26   0.797     -1.39749    1.818583
    nodegree |  -.2366878   .5406049    -0.44   0.662    -1.296254    .8228783
        re74 |  -.0000522   .0000308    -1.69   0.090    -.0001126    8.18e-06
        re75 |   .0000168   .0000538     0.31   0.754    -.0000886    .0001222
       _cons |  -3.394577   1.892911    -1.79   0.073    -7.104614    .3154608
------------------------------------------------------------------------------
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            re78  Unmatched | 5749.76612   11278.8936   -5529.1275   2075.03917    -2.66
                        ATT |  5723.8305   10340.7416  -4616.91111    5184.2937    -0.89
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0        137 |       137 
   Treated |         1         38 |        39 
-----------+----------------------+----------
     Total |         1        175 |       176 


. pstest re78, both

------------------------------------------------------------------------------
                Unmatched |       Mean               %reduct |     t-test
    Variable      Matched | Treated Control    %bias  |bias| |    t    p>|t|
--------------------------+----------------------------------+----------------
         re78   Unmatched | 5749.8    11279    -57.0         |  -2.66  0.008
                 Matched  | 5723.8    10341    -47.6    16.5 |  -1.37  0.174
                          |                                  |
------------------------------------------------------------------------------
-------------------------------------------------------------
         Summary of the distribution of the abs(bias)
-------------------------------------------------------------

                       BEFORE MATCHING
-------------------------------------------------------------
      Percentiles      Smallest
 1%     57.02866       57.02866
 5%     57.02866              .
10%     57.02866              .       Obs                   1
25%     57.02866              .       Sum of Wgt.           1

50%     57.02866                      Mean           57.02866
                        Largest       Std. Dev.             .
75%     57.02866              .
90%     57.02866              .       Variance              .
95%     57.02866              .       Skewness              .
99%     57.02866       57.02866       Kurtosis              .
-------------------------------------------------------------

                       AFTER MATCHING
-------------------------------------------------------------
      Percentiles      Smallest
 1%     47.61986       47.61986
 5%     47.61986              .
10%     47.61986              .       Obs                   1
25%     47.61986              .       Sum of Wgt.           1

50%     47.61986                      Mean           47.61986
                        Largest       Std. Dev.             .
75%     47.61986              .
90%     47.61986              .       Variance              .
95%     47.61986              .       Skewness              .
99%     47.61986       47.61986       Kurtosis              .
-------------------------------------------------------------

-----------------------------------------------------------------
 Sample  | Pseudo R2    LR chi2    p>chi2    MeanBias    MedBias
---------+-------------------------------------------------------
 Raw     |    0.071       13.19    0.000       57.0       57.0
 Matched |    0.024        2.50    0.114       47.6       47.6
-----------------------------------------------------------------

. psmatch2 d age agesq educ black hisp married nodegree re74 re75 if quartiles2==3, out(re78) common 

Probit regression                                 Number of obs   =        135
                                                  LR chi2(9)      =      40.52
                                                  Prob > chi2     =     0.0000
Log likelihood =  -70.17676                       Pseudo R2       =     0.2240

------------------------------------------------------------------------------
           d |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .3702742   .1596155     2.32   0.020     .0574336    .6831148
       agesq |  -.0075524   .0028584    -2.64   0.008    -.0131547   -.0019501
        educ |   .1875839   .0947245     1.98   0.048     .0019273    .3732405
       black |   2.659246   .8616149     3.09   0.002     .9705114     4.34798
        hisp |   4.141166   1.137579     3.64   0.000     1.911552    6.370781
     married |  -3.142127   .8550156    -3.67   0.000    -4.817926   -1.466327
    nodegree |    2.58683   .6991478     3.70   0.000     1.216526    3.957135
        re74 |  -.0000782   .0000259    -3.01   0.003     -.000129   -.0000273
        re75 |  -.0002221   .0000521    -4.27   0.000    -.0003241     -.00012
       _cons |  -7.427518   2.679608    -2.77   0.006    -12.67945   -2.175583
------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            re78  Unmatched | 5149.46479   8726.92338  -3577.45859   1095.82403    -3.26
                        ATT | 5930.57903   7587.87502  -1657.29599   2005.03677    -0.83
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0         53 |        53 
   Treated |        29         53 |        82 
-----------+----------------------+----------
     Total |        29        106 |       135 


. pstest re78, both

------------------------------------------------------------------------------
                Unmatched |       Mean               %reduct |     t-test
    Variable      Matched | Treated Control    %bias  |bias| |    t    p>|t|
--------------------------+----------------------------------+----------------
         re78   Unmatched | 5149.5   8726.9    -56.3         |  -3.26  0.001
                 Matched  | 5930.6   7587.9    -26.1    53.7 |  -1.26  0.210
                          |                                  |
------------------------------------------------------------------------------
-------------------------------------------------------------
         Summary of the distribution of the abs(bias)
-------------------------------------------------------------

                       BEFORE MATCHING
-------------------------------------------------------------
      Percentiles      Smallest
 1%     56.29675       56.29675
 5%     56.29675              .
10%     56.29675              .       Obs                   1
25%     56.29675              .       Sum of Wgt.           1

50%     56.29675                      Mean           56.29675
                        Largest       Std. Dev.             .
75%     56.29675              .
90%     56.29675              .       Variance              .
95%     56.29675              .       Skewness              .
99%     56.29675       56.29675       Kurtosis              .
-------------------------------------------------------------

                       AFTER MATCHING
-------------------------------------------------------------
      Percentiles      Smallest
 1%     26.08007       26.08007
 5%     26.08007              .
10%     26.08007              .       Obs                   1
25%     26.08007              .       Sum of Wgt.           1

50%     26.08007                      Mean           26.08007
                        Largest       Std. Dev.             .
75%     26.08007              .
90%     26.08007              .       Variance              .
95%     26.08007              .       Skewness              .
99%     26.08007       26.08007       Kurtosis              .
-------------------------------------------------------------

-----------------------------------------------------------------
 Sample  | Pseudo R2    LR chi2    p>chi2    MeanBias    MedBias
---------+-------------------------------------------------------
 Raw     |    0.056       10.08    0.001       56.3       56.3
 Matched |    0.011        1.61    0.205       26.1       26.1
-----------------------------------------------------------------

. psmatch2 d age agesq educ black hisp married nodegree re74 re75 if quartiles2==4, out(re78) common 
note: hisp dropped because of collinearity
note: married dropped because of collinearity

Probit regression                                 Number of obs   =        323
                                                  LR chi2(7)      =      36.82
                                                  Prob > chi2     =     0.0000
Log likelihood = -110.16081                       Pseudo R2       =     0.1432

------------------------------------------------------------------------------
           d |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   -.276143   .1639172    -1.68   0.092    -.5974148    .0451287
       agesq |   .0048289   .0031208     1.55   0.122    -.0012877    .0109455
        educ |   .0411614   .0702178     0.59   0.558     -.096463    .1787858
       black |  -.1973217   .3370138    -0.59   0.558    -.8578566    .4632133
    nodegree |   .7094278   .3337189     2.13   0.034     .0553508    1.363505
        re74 |  -.0000264   .0000263    -1.00   0.315     -.000078    .0000251
        re75 |  -.0001361   .0000381    -3.57   0.000    -.0002107   -.0000614
       _cons |   4.331826   2.169331     2.00   0.046     .0800148    8.583637
------------------------------------------------------------------------------
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            re78  Unmatched | 4597.81884   6253.94035  -1656.12151   893.275028    -1.85
                        ATT | 4527.91027    3441.6252   1086.28507   1380.15973     0.79
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0         44 |        44 
   Treated |        57        222 |       279 
-----------+----------------------+----------
     Total |        57        266 |       323 


. pstest re78, both

------------------------------------------------------------------------------
                Unmatched |       Mean               %reduct |     t-test
    Variable      Matched | Treated Control    %bias  |bias| |    t    p>|t|
--------------------------+----------------------------------+----------------
         re78   Unmatched | 4597.8   6253.9    -30.3         |  -1.85  0.065
                 Matched  | 4527.9   3441.6     19.9    34.4 |   2.13  0.034
                          |                                  |
------------------------------------------------------------------------------
-------------------------------------------------------------
         Summary of the distribution of the abs(bias)
-------------------------------------------------------------

                       BEFORE MATCHING
-------------------------------------------------------------
      Percentiles      Smallest
 1%     30.30035       30.30035
 5%     30.30035              .
10%     30.30035              .       Obs                   1
25%     30.30035              .       Sum of Wgt.           1

50%     30.30035                      Mean           30.30035
                        Largest       Std. Dev.             .
75%     30.30035              .
90%     30.30035              .       Variance              .
95%     30.30035              .       Skewness              .
99%     30.30035       30.30035       Kurtosis              .
-------------------------------------------------------------

                       AFTER MATCHING
-------------------------------------------------------------
      Percentiles      Smallest
 1%     19.87464       19.87464
 5%     19.87464              .
10%     19.87464              .       Obs                   1
25%     19.87464              .       Sum of Wgt.           1

50%     19.87464                      Mean           19.87464
                        Largest       Std. Dev.             .
75%     19.87464              .
90%     19.87464              .       Variance              .
95%     19.87464              .       Skewness              .
99%     19.87464       19.87464       Kurtosis              .
-------------------------------------------------------------

-----------------------------------------------------------------
 Sample  | Pseudo R2    LR chi2    p>chi2    MeanBias    MedBias
---------+-------------------------------------------------------
 Raw     |    0.013        3.28    0.070       30.3       30.3
 Matched |    0.007        4.57    0.033       19.9       19.9
-----------------------------------------------------------------

. 
. *8 bootstrap se
. psmatch2 d age agesq educ black hisp married nodegree re74 re75, out(re78)  common

Probit regression                                 Number of obs   =       2915
                                                  LR chi2(9)      =    1574.47
                                                  Prob > chi2     =     0.0000
Log likelihood = -423.50897                       Pseudo R2       =     0.6502

------------------------------------------------------------------------------
           d |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .0914548   .0422493     2.16   0.030     .0086477    .1742618
       agesq |  -.0022069   .0006545    -3.37   0.001    -.0034898   -.0009241
        educ |   .0123268   .0306812     0.40   0.688    -.0478073    .0724609
       black |   1.071924   .1202664     8.91   0.000     .8362057    1.307641
        hisp |   1.317937   .2062251     6.39   0.000      .913743     1.72213
     married |  -1.230043   .1040172   -11.83   0.000    -1.433913   -1.026173
    nodegree |   .8606035   .1422113     6.05   0.000     .5818744    1.139333
        re74 |  -.0000224   9.65e-06    -2.32   0.020    -.0000413   -3.48e-06
        re75 |  -.0000587   .0000108    -5.44   0.000    -.0000799   -.0000376
       _cons |  -1.562726   .7185895    -2.17   0.030    -2.971136   -.1543169
------------------------------------------------------------------------------
Note: 159 failures and 0 successes completely determined.
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            re78  Unmatched |  5090.0482   21553.9209  -16463.8727   763.288686   -21.57
                        ATT | 5033.57854   6079.48222  -1045.90368   1439.01747    -0.73
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,490 |     2,490 
   Treated |        27        398 |       425 
-----------+----------------------+----------
     Total |        27      2,888 |     2,915 


. set seed 1

. bootstrap r(att), reps (10): psmatch2 d age agesq educ black hisp married nodegree re74 re75, out(re78)  common
(running psmatch2 on estimation sample)
Note: S.E. does not take into account that the propensity score is estimated.

Bootstrap replications (10)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..........

Bootstrap results                               Number of obs      =      2915
                                                Replications       =        10

      command:  psmatch2 d age agesq educ black hisp married nodegree re74 re75, out(re78) common
        _bs_1:  r(att)

------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |  -1045.904   1249.239    -0.84   0.402    -3494.368    1402.561
------------------------------------------------------------------------------

. set seed 1

. bootstrap r(att), reps (100): psmatch2 d age agesq educ black hisp married nodegree re74 re75, out(re78)  common
(running psmatch2 on estimation sample)
Note: S.E. does not take into account that the propensity score is estimated.

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100

Bootstrap results                               Number of obs      =      2915
                                                Replications       =       100

      command:  psmatch2 d age agesq educ black hisp married nodegree re74 re75, out(re78) common
        _bs_1:  r(att)

------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |  -1045.904   973.7586    -1.07   0.283    -2954.435    862.6281
------------------------------------------------------------------------------

. 
. *9 regression-adjusted estimator
. psmatch2 d age agesq educ black hisp married nodegree re74 re75, out(re78) common 

Probit regression                                 Number of obs   =       2915
                                                  LR chi2(9)      =    1574.47
                                                  Prob > chi2     =     0.0000
Log likelihood = -423.50897                       Pseudo R2       =     0.6502

------------------------------------------------------------------------------
           d |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .0914548   .0422493     2.16   0.030     .0086477    .1742618
       agesq |  -.0022069   .0006545    -3.37   0.001    -.0034898   -.0009241
        educ |   .0123268   .0306812     0.40   0.688    -.0478073    .0724609
       black |   1.071924   .1202664     8.91   0.000     .8362057    1.307641
        hisp |   1.317937   .2062251     6.39   0.000      .913743     1.72213
     married |  -1.230043   .1040172   -11.83   0.000    -1.433913   -1.026173
    nodegree |   .8606035   .1422113     6.05   0.000     .5818744    1.139333
        re74 |  -.0000224   9.65e-06    -2.32   0.020    -.0000413   -3.48e-06
        re75 |  -.0000587   .0000108    -5.44   0.000    -.0000799   -.0000376
       _cons |  -1.562726   .7185895    -2.17   0.030    -2.971136   -.1543169
------------------------------------------------------------------------------
Note: 159 failures and 0 successes completely determined.
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            re78  Unmatched |  5090.0482   21553.9209  -16463.8727   763.288686   -21.57
                        ATT | 5033.57854   6079.48222  -1045.90368   1439.01747    -0.73
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,490 |     2,490 
   Treated |        27        398 |       425 
-----------+----------------------+----------
     Total |        27      2,888 |     2,915 


. reg re78 age agesq educ black hisp married nodegree re74 re75 d [fweight=_weight]

      Source |       SS       df       MS              Number of obs =     796
-------------+------------------------------           F( 10,   785) =   22.36
       Model |  7.7421e+09    10   774206774           Prob > F      =  0.0000
    Residual |  2.7185e+10   785  34630186.3           R-squared     =  0.2217
-------------+------------------------------           Adj R-squared =  0.2118
       Total |  3.4927e+10   795  43933036.4           Root MSE      =  5884.7

------------------------------------------------------------------------------
        re78 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   85.24281   226.1334     0.38   0.706    -358.6548    529.1405
       agesq |  -.6183348   3.824514    -0.16   0.872     -8.12582     6.88915
        educ |   369.8164   148.1972     2.50   0.013     78.90681    660.7261
       black |  -2463.321   778.9393    -3.16   0.002    -3992.372   -934.2706
        hisp |   18.53552   1294.822     0.01   0.989    -2523.188    2560.259
     married |   482.7297   616.9756     0.78   0.434    -728.3875    1693.847
    nodegree |  -967.7326   668.7786    -1.45   0.148    -2280.539    345.0734
        re74 |   .1960933   .0557201     3.52   0.000     .0867153    .3054713
        re75 |   .2505658   .0647093     3.87   0.000     .1235422    .3775895
           d |  -832.6943    428.203    -1.94   0.052    -1673.253    7.864188
       _cons |   1592.084   3502.817     0.45   0.650    -5283.913    8468.082
------------------------------------------------------------------------------

. 
. *10 gaussian kernel
. psmatch2 d age agesq educ black hisp married nodegree re74 re75, kernel out(re78) k(normal) bw(0.02) common 

Probit regression                                 Number of obs   =       2915
                                                  LR chi2(9)      =    1574.47
                                                  Prob > chi2     =     0.0000
Log likelihood = -423.50897                       Pseudo R2       =     0.6502

------------------------------------------------------------------------------
           d |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .0914548   .0422493     2.16   0.030     .0086477    .1742618
       agesq |  -.0022069   .0006545    -3.37   0.001    -.0034898   -.0009241
        educ |   .0123268   .0306812     0.40   0.688    -.0478073    .0724609
       black |   1.071924   .1202664     8.91   0.000     .8362057    1.307641
        hisp |   1.317937   .2062251     6.39   0.000      .913743     1.72213
     married |  -1.230043   .1040172   -11.83   0.000    -1.433913   -1.026173
    nodegree |   .8606035   .1422113     6.05   0.000     .5818744    1.139333
        re74 |  -.0000224   9.65e-06    -2.32   0.020    -.0000413   -3.48e-06
        re75 |  -.0000587   .0000108    -5.44   0.000    -.0000799   -.0000376
       _cons |  -1.562726   .7185895    -2.17   0.030    -2.971136   -.1543169
------------------------------------------------------------------------------
Note: 159 failures and 0 successes completely determined.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            re78  Unmatched |  5090.0482   21553.9209  -16463.8727   763.288686   -21.57
                        ATT | 5033.57854   6610.78931  -1577.21077   2008.76692    -0.79
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,490 |     2,490 
   Treated |        27        398 |       425 
-----------+----------------------+----------
     Total |        27      2,888 |     2,915 


. psmatch2 d age agesq educ black hisp married nodegree re74 re75, kernel out(re78) k(normal) bw(0.2) common 

Probit regression                                 Number of obs   =       2915
                                                  LR chi2(9)      =    1574.47
                                                  Prob > chi2     =     0.0000
Log likelihood = -423.50897                       Pseudo R2       =     0.6502

------------------------------------------------------------------------------
           d |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .0914548   .0422493     2.16   0.030     .0086477    .1742618
       agesq |  -.0022069   .0006545    -3.37   0.001    -.0034898   -.0009241
        educ |   .0123268   .0306812     0.40   0.688    -.0478073    .0724609
       black |   1.071924   .1202664     8.91   0.000     .8362057    1.307641
        hisp |   1.317937   .2062251     6.39   0.000      .913743     1.72213
     married |  -1.230043   .1040172   -11.83   0.000    -1.433913   -1.026173
    nodegree |   .8606035   .1422113     6.05   0.000     .5818744    1.139333
        re74 |  -.0000224   9.65e-06    -2.32   0.020    -.0000413   -3.48e-06
        re75 |  -.0000587   .0000108    -5.44   0.000    -.0000799   -.0000376
       _cons |  -1.562726   .7185895    -2.17   0.030    -2.971136   -.1543169
------------------------------------------------------------------------------
Note: 159 failures and 0 successes completely determined.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            re78  Unmatched |  5090.0482   21553.9209  -16463.8727   763.288686   -21.57
                        ATT | 5033.57854   10729.2062  -5695.62769   1265.87766    -4.50
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,490 |     2,490 
   Treated |        27        398 |       425 
-----------+----------------------+----------
     Total |        27      2,888 |     2,915 


. psmatch2 d age agesq educ black hisp married nodegree re74 re75, kernel out(re78) k(normal) bw(2) common 

Probit regression                                 Number of obs   =       2915
                                                  LR chi2(9)      =    1574.47
                                                  Prob > chi2     =     0.0000
Log likelihood = -423.50897                       Pseudo R2       =     0.6502

------------------------------------------------------------------------------
           d |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .0914548   .0422493     2.16   0.030     .0086477    .1742618
       agesq |  -.0022069   .0006545    -3.37   0.001    -.0034898   -.0009241
        educ |   .0123268   .0306812     0.40   0.688    -.0478073    .0724609
       black |   1.071924   .1202664     8.91   0.000     .8362057    1.307641
        hisp |   1.317937   .2062251     6.39   0.000      .913743     1.72213
     married |  -1.230043   .1040172   -11.83   0.000    -1.433913   -1.026173
    nodegree |   .8606035   .1422113     6.05   0.000     .5818744    1.139333
        re74 |  -.0000224   9.65e-06    -2.32   0.020    -.0000413   -3.48e-06
        re75 |  -.0000587   .0000108    -5.44   0.000    -.0000799   -.0000376
       _cons |  -1.562726   .7185895    -2.17   0.030    -2.971136   -.1543169
------------------------------------------------------------------------------
Note: 159 failures and 0 successes completely determined.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            re78  Unmatched |  5090.0482   21553.9209  -16463.8727   763.288686   -21.57
                        ATT | 5033.57854   21486.5267  -16452.9482   426.588911   -38.57
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,490 |     2,490 
   Treated |        27        398 |       425 
-----------+----------------------+----------
     Total |        27      2,888 |     2,915 


. 
. */
. *11 local linear
. psmatch2 d age agesq educ black hisp married nodegree re74 re75, llr out(re78) bw(0.02) common 

Probit regression                                 Number of obs   =       2915
                                                  LR chi2(9)      =    1574.47
                                                  Prob > chi2     =     0.0000
Log likelihood = -423.50897                       Pseudo R2       =     0.6502

------------------------------------------------------------------------------
           d |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .0914548   .0422493     2.16   0.030     .0086477    .1742618
       agesq |  -.0022069   .0006545    -3.37   0.001    -.0034898   -.0009241
        educ |   .0123268   .0306812     0.40   0.688    -.0478073    .0724609
       black |   1.071924   .1202664     8.91   0.000     .8362057    1.307641
        hisp |   1.317937   .2062251     6.39   0.000      .913743     1.72213
     married |  -1.230043   .1040172   -11.83   0.000    -1.433913   -1.026173
    nodegree |   .8606035   .1422113     6.05   0.000     .5818744    1.139333
        re74 |  -.0000224   9.65e-06    -2.32   0.020    -.0000413   -3.48e-06
        re75 |  -.0000587   .0000108    -5.44   0.000    -.0000799   -.0000376
       _cons |  -1.562726   .7185895    -2.17   0.030    -2.971136   -.1543169
------------------------------------------------------------------------------
Note: 159 failures and 0 successes completely determined.
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            re78  Unmatched |  5090.0482   21553.9209  -16463.8727   763.288686   -21.57
                        ATT | 5033.57854   6520.33419  -1486.75565            .        .
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,490 |     2,490 
   Treated |        27        398 |       425 
-----------+----------------------+----------
     Total |        27      2,888 |     2,915 


. psmatch2 d age agesq educ black hisp married nodegree re74 re75, llr out(re78) bw(0.2) common 

Probit regression                                 Number of obs   =       2915
                                                  LR chi2(9)      =    1574.47
                                                  Prob > chi2     =     0.0000
Log likelihood = -423.50897                       Pseudo R2       =     0.6502

------------------------------------------------------------------------------
           d |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .0914548   .0422493     2.16   0.030     .0086477    .1742618
       agesq |  -.0022069   .0006545    -3.37   0.001    -.0034898   -.0009241
        educ |   .0123268   .0306812     0.40   0.688    -.0478073    .0724609
       black |   1.071924   .1202664     8.91   0.000     .8362057    1.307641
        hisp |   1.317937   .2062251     6.39   0.000      .913743     1.72213
     married |  -1.230043   .1040172   -11.83   0.000    -1.433913   -1.026173
    nodegree |   .8606035   .1422113     6.05   0.000     .5818744    1.139333
        re74 |  -.0000224   9.65e-06    -2.32   0.020    -.0000413   -3.48e-06
        re75 |  -.0000587   .0000108    -5.44   0.000    -.0000799   -.0000376
       _cons |  -1.562726   .7185895    -2.17   0.030    -2.971136   -.1543169
------------------------------------------------------------------------------
Note: 159 failures and 0 successes completely determined.
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            re78  Unmatched |  5090.0482   21553.9209  -16463.8727   763.288686   -21.57
                        ATT | 5033.57854   7301.21835  -2267.63981            .        .
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,490 |     2,490 
   Treated |        27        398 |       425 
-----------+----------------------+----------
     Total |        27      2,888 |     2,915 


. psmatch2 d age agesq educ black hisp married nodegree re74 re75, llr out(re78) bw(2) common 

Probit regression                                 Number of obs   =       2915
                                                  LR chi2(9)      =    1574.47
                                                  Prob > chi2     =     0.0000
Log likelihood = -423.50897                       Pseudo R2       =     0.6502

------------------------------------------------------------------------------
           d |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .0914548   .0422493     2.16   0.030     .0086477    .1742618
       agesq |  -.0022069   .0006545    -3.37   0.001    -.0034898   -.0009241
        educ |   .0123268   .0306812     0.40   0.688    -.0478073    .0724609
       black |   1.071924   .1202664     8.91   0.000     .8362057    1.307641
        hisp |   1.317937   .2062251     6.39   0.000      .913743     1.72213
     married |  -1.230043   .1040172   -11.83   0.000    -1.433913   -1.026173
    nodegree |   .8606035   .1422113     6.05   0.000     .5818744    1.139333
        re74 |  -.0000224   9.65e-06    -2.32   0.020    -.0000413   -3.48e-06
        re75 |  -.0000587   .0000108    -5.44   0.000    -.0000799   -.0000376
       _cons |  -1.562726   .7185895    -2.17   0.030    -2.971136   -.1543169
------------------------------------------------------------------------------
Note: 159 failures and 0 successes completely determined.
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
            re78  Unmatched |  5090.0482   21553.9209  -16463.8727   763.288686   -21.57
                        ATT | 5033.57854   7666.36656  -2632.78802            .        .
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,490 |     2,490 
   Treated |        27        398 |       425 
-----------+----------------------+----------
     Total |        27      2,888 |     2,915 


. 
. 
. log close
      name:  <unnamed>
       log:  /Users/robertackerman/Desktop/School/Labor Econ I/HW/HW3_Ackerman.log
  log type:  text
 closed on:  17 Jul 2014, 17:38:54
--------------------------------------------------------------------------------------------------------------------------
